SellersMarket/market/app/controllers/products_controller.rb

  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO `products` (`image_url`, `updated_at`, `price`, `video_url`, `description`, `label`, `created_at`) VALUES('test_data2.jpg', '2009-05-01 01:55:44', 75.0, 'test_data2.avi', 'This is the second input for the Sellers Market web app. Test against some data fixtures for better development practice.', 'Test Data 2', '2009-05-01 01:55:44')

  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])
---
SELECT * FROM `products` WHERE (`products`.`id` = 1)
UPDATE `products` SET `description` = '<p> \r\n This is just some test data to test against the Sellers Market web app. \r\n </p>', `updated_at` = '2009-05-01 01:57:32', `image_url` = '/images/test_data.jpg' WHERE `id` = 1