SellersMarket/market/app/controllers/users_controller.rb

INSERT INTO `users` (`salt`, `updated_at`, `crypted_password`, `remember_token_expires_at`, `remember_token`, `login`, `email`, `created_at`) VALUES('c91a4a52e3ec06bb029410d1b5fc42746bb31f3b', '2009-06-25 00:51:00', '883b417a4aeac32c858da578d3c828fa8f435367', NULL, NULL, 'admin', 'admin@gmail.com', '2009-06-25 00:51:00')
---
  def create
    cookies.delete :auth_token
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    # reset_session
    @user = User.new(params[:user])
    @user.save!