SellersMarket/market/app/controllers/warehouse_controller.rb

SELECT * FROM `products` ORDER BY label
---
  def index

    @products = Product.find_products_to_be_sold

SELECT * FROM `products` WHERE (`products`.`id` = 1)
---
  def add_to_basket

  product = Product.find(params[:id])

INSERT INTO `invoices` (`name`, `updated_at`, `transaction_type`, `address`, `email`, `created_at`) VALUES('form test data ', '2009-05-18 18:41:27', 'credit', 'this is the 1st incremental cycle in the project\'s lifecycle', 'testdata@gmail.com', '2009-05-18 18:41:27')
INSERT INTO `line_items` (`updated_at`, `invoice_id`, `price_sum`, `product_id`, `quantity`, `created_at`) VALUES('2009-05-18 18:41:27', 1, 49, 1, 1, '2009-05-18 18:41:27')
---
   def save_invoice
   	   @basket = get_basket
   	   @invoice = Invoice.new(params[:invoice])
   	   @invoice.line_items_from_basket_addition(@basket)

   	if @invoice.save